In [1]:
import pandas as pd
import numpy as np
import os

# Q1-1

```
아래의 데이타를 이용하여 데이타프레임을 생성하여라.
name_list는 인덱스로 이용한다. 

data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}
        
name_list = ['고길동','김희동','신윤지','이민호','박준희']        
```

In [3]:
data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}
        
name_list = ['고길동','김희동','신윤지','이민호','박준희']

df1 = pd.DataFrame(data, index = name_list)
df1

     kor  math  eng
고길동   40    70   80
김희동   55    55   95
신윤지   66    66  100
이민호   77    20   77
박준희   34    40   90

# Q1-2
```
2명의 데이타를 추가하여라. 

신머신	55	67	88
윤파이	90	100	90
```

In [6]:
df1.loc['신머신'] = [55, 67, 88]
df1.loc['윤파이'] = [90, 100, 90]
df1

     kor  math  eng
고길동   40    70   80
김희동   55    55   95
신윤지   66    66  100
이민호   77    20   77
박준희   34    40   90
신머신   55    67   88
윤파이   90   100   90

# Q1-3
sci 과목의 데이타를 추가하여라 

90, 45, 77, 90, 67, 90, 80

In [7]:
df1['sci'] = [90, 45, 77, 90, 67, 90, 80]
df1

     kor  math  eng  sci
고길동   40    70   80   90
김희동   55    55   95   45
신윤지   66    66  100   77
이민호   77    20   77   90
박준희   34    40   90   67
신머신   55    67   88   90
윤파이   90   100   90   80

# Q1-4
eng 과목에서 eng 평균점수보다 높은 학생은?

In [8]:
df1.eng.mean()

88.57142857142857

In [14]:
df1[df1.eng > df1.eng.mean()].index

Index(['김희동', '신윤지', '박준희', '윤파이'], dtype='object')

# Q1-5
```
전체 과목의 평균을 구한 후 평균이상이면 O, 평균미만이면 X를 pass 컬럼에 출력하여라.
```

In [25]:
df1.mean().mean()

71.21428571428571

In [28]:
df1['pass'] = df1.mean(axis=1).apply(lambda i: 'O' if i >= df1.mean().mean() else 'X')
df1

     kor  math  eng  sci pass
고길동   40    70   80   90    X
김희동   55    55   95   45    X
신윤지   66    66  100   77    O
이민호   77    20   77   90    X
박준희   34    40   90   67    X
신머신   55    67   88   90    O
윤파이   90   100   90   80    O

## Q 2-1
아래의 리스트를 이용하여 df_student 데이타프레임을 생성하여라 

```
student_list = [ { 'name' : 'John', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Nate', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Abrabam', 'major' : 'Physics', 'gender' : 'male'},
                 { 'name' : 'Brian', 'major' : 'Psychology', 'gender' : 'male'},
                 { 'name' : 'Jenny', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Yuba', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Jennifer', 'major' : 'Computer Science', 'gender' : 'female'},
                 { 'name' : 'Edward', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Sara', 'major' : 'Psychology', 'gender' : 'female'},
                 { 'name' : 'Wendy', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Sera', 'major' : 'Psychology', 'gender' : 'female'}
               ]
```

In [29]:
student_list = [ { 'name' : 'John', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Nate', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Abrabam', 'major' : 'Physics', 'gender' : 'male'},
                 { 'name' : 'Brian', 'major' : 'Psychology', 'gender' : 'male'},
                 { 'name' : 'Jenny', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Yuba', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Jennifer', 'major' : 'Computer Science', 'gender' : 'female'},
                 { 'name' : 'Edward', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Sara', 'major' : 'Psychology', 'gender' : 'female'},
                 { 'name' : 'Wendy', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Sera', 'major' : 'Psychology', 'gender' : 'female'}
               ]

df2 = pd.DataFrame(student_list)
df2

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abrabam           Physics    male
3      Brian        Psychology    male
4      Jenny         Economics  female
5       Yuba         Economics  female
6   Jennifer  Computer Science  female
7     Edward  Computer Science    male
8       Sara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

## Q 2-2
df_student 데이타프레임의 인덱스를 std1 ~ std11 형태로 변경하여라

In [30]:
df2.index = ['std1','std2','std3','std4','std5','std6','std7','std8','std9','std10','std11']
df2

           name             major  gender
std1       John  Computer Science    male
std2       Nate  Computer Science    male
std3    Abrabam           Physics    male
std4      Brian        Psychology    male
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std8     Edward  Computer Science    male
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

In [ ]:
#ChatGPT의 의견
index_list = [f'std{i+1}' for i in range(len(student_list))]
df2 = pd.DataFrame(student_list, index=index_list)

## Q 2-3
df_student 데이타프레임에서 gender 컬럼이 female 값을 가진 데이타만 별도로 데이타프레임 df_student_female 로 생성하여라.

In [33]:
df2_f = df2[df2['gender'] == 'female']
df2_f

           name             major  gender
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

## Q 2-4
df_student_female 데이타프레임에서 name 컬럼을 인덱스로 설정하고 gender 컬럼을 삭제하여라

In [40]:
df2_f[['name','major']].set_index('name',drop=True)

                     major
name
Jenny            Economics
Yuba             Economics
Jennifer  Computer Science
Sara            Psychology
Wendy            Economics
Sera            Psychology

## Q 2-5
df_student 데이타프레임에서 'Computer Science' 과를 제외한 나머지 데이타로 데이타프레임 df_student2를 생성하여라. 이때 인덱스는 name 컬럼으로 변경한다

In [42]:
df2

           name             major  gender
std1       John  Computer Science    male
std2       Nate  Computer Science    male
std3    Abrabam           Physics    male
std4      Brian        Psychology    male
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std8     Edward  Computer Science    male
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

In [50]:
df_student2 = df2[df2['major']!='Computer Science'].set_index('name',drop=True)
df_student2

              major  gender
name
Abrabam     Physics    male
Brian    Psychology    male
Jenny     Economics  female
Yuba      Economics  female
Sara     Psychology  female
Wendy     Economics  female
Sera     Psychology  female

## Q 2-6
df_student2 에서 Brian, Sara의 데이타를 삭제하고 grade 컬럼을 추가하여라 

4.5, 4.0, 3.5, 4.0, 3.0

In [63]:
df_student2.drop(['Brian','Sara'],axis=0, inplace=True)
df_student2

              major  gender
name
Abrabam     Physics    male
Jenny     Economics  female
Yuba      Economics  female
Wendy     Economics  female
Sera     Psychology  female

In [64]:
df_student2['grade'] = [4.5, 4.0, 3.5, 4.0, 3.0]
df_student2

              major  gender  grade
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

## Q 2-7
df_student2 데이타프레임에서 grade 컬럼명을 score로 변경하고 <br>
전체 컬럼 순서를 gender, score, major 순서로 변경하여라

In [67]:
df_student2.rename(columns={'grade':'score'}, inplace=True)
df_student2

              major  gender  score
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

## Q 2-8
df_student2.describe() 명령을 이용하여 아래와 같이 출력하여라

In [69]:
df_student2.describe()

          score
count  5.000000
mean   3.800000
std    0.570088
min    3.000000
25%    3.500000
50%    4.000000
75%    4.000000
max    4.500000

## Q3-1
```
아래의 CSV 파일을 df_weather 데이타프레임으로 생성하여라. 
이때 컬럼은 일시, 평균기온, 최고기온, 최저기온 으로만 한다 

기상온도_서울202012.csv

```

           일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0  1907-10-01     13.9     25.4      3.3
1  1907-11-01      5.3     21.3     -8.9
2  1907-12-01     -3.9      9.0    -20.1
3  1908-01-01     -3.5      6.2    -14.3
4  1908-02-01     -4.0      8.4    -15.8

## Q3-2
```
df_weather 데이타프레임에서 결측값이 각 컬럼별로 몇개가 있는지 출력하여라 
```

일시          8
평균기온(℃)    33
최고기온(℃)    33
최저기온(℃)    33
dtype: int64

## Q3-3
```
df_weather 데이타프레임에서 '일시' 컬럼값이 결측값 NaN으로 지정된 데이타를 출력하여라 
```

Int64Index([1345, 1346, 1347, 1348, 1349, 1350, 1351, 1352], dtype='int64')

## Q3-4
```
df_weather 데이타프레임에서 행 모두의 값이 NaN이면 삭제하여라 
```

## Q3-5
```
df_weather 데이타프레임에서 결측값을 모두 0으로 변경하여라
```

일시         0
평균기온(℃)    0
최고기온(℃)    0
최저기온(℃)    0
dtype: int64

## Q3-6
```
df_weather 데이타프레임에서 '일시' 컬럼의 데이타형을 시계열 형태로 변경하고 인덱스로 설정하여라. 
```

In [128]:
df_weather.dtypes

일시         datetime64[ns]
평균기온(℃)           float64
최고기온(℃)           float64
최저기온(℃)           float64
dtype: object

## Q3-7
```
df_weather 데이타프레임에서 2000 이후의 데이타만 출력하여라 
```

            평균기온(℃)  최고기온(℃)  최저기온(℃)
일시
2000-01-01     -2.1      9.9    -12.1
2000-02-01     -1.7      7.5    -11.6
2000-03-01      6.3     18.9     -4.8
2000-04-01     11.9     23.5      1.8
2000-05-01     17.5     30.5      7.9
...             ...      ...      ...
2020-08-01     26.5     34.5     21.5
2020-09-01     21.4     29.5     13.6
2020-10-01     14.3     23.6      3.2
2020-11-01      8.0     20.0     -3.6
2020-12-01     -0.2      9.4    -11.2

[252 rows x 3 columns]